Terraform Plan for terraform/eus/dev/backend:

```
azurerm_storage_blob.site["assets/index-p0OaVyvT.js"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-p0OaVyvT.js]
data.azurerm_container_app_environment.aca_env: Reading...
data.azurerm_postgresql_flexible_server.ops_dbs: Reading...
data.azurerm_key_vault.vault: Reading...
data.azurerm_key_vault.vault: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.KeyVault/vaults/opre-ops-dev-eus-core-kv]
data.azurerm_key_vault_secret.ops-jwt-private-key: Reading...
data.azurerm_key_vault_secret.ops-pw: Reading...
data.azurerm_container_app_environment.aca_env: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae]
data.azurerm_key_vault_secret.ops-pw: Read complete after 1s [id=https://opre-ops-dev-eus-core-kv.vault.azure.net/secrets/ops-role-password/09ab85f39f0f4033bad60333fb584f93]
data.azurerm_postgresql_flexible_server.ops_dbs: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opre-ops-dev-eus-db-psql]
data.azurerm_key_vault_secret.ops-jwt-private-key: Read complete after 1s [id=https://opre-ops-dev-eus-core-kv.vault.azure.net/secrets/ops-jwt-private-key/f4cec3a063e24ab1aba6dd83c63fbc0a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.backend will be created
  + resource "azurerm_container_app" "backend" {
      + container_app_environment_id  = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "opre-ops-dev-eus-be-ca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "opre-ops-dev-eus-core-rg"
      + revision_mode                 = "Multiple"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 1
          + revision_suffix = "1bdbf668"

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/hhs/opre-ops/ops-backend:1bdbf6684acd02f35249bf16bceb92af40a8978d"
              + memory            = "0.5Gi"
              + name              = "ops-backend"

              + env {
                  + name  = "OPS_CONFIG"
                  + value = "environment/azure/dev.py"
                }
              + env {
                  + name  = "PGUSER"
                  + value = "ops"
                }
              + env {
                  + name        = "PGPASSWORD"
                  + secret_name = "pgpassword"
                }
              + env {
                  + name  = "PGHOST"
                  + value = "opre-ops-dev-eus-db-psql.postgres.database.azure.com"
                }
              + env {
                  + name  = "PGPORT"
                  + value = "5432"
                }
              + env {
                  + name  = "PGDATABASE"
                  + value = "postgres"
                }
              + env {
                  + name        = "JWT_PRIVATE_KEY"
                  + secret_name = "jwt-private-key"
                }
              + env {
                  + name  = "OPS_FRONTEND_URL"
                  + value = "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
                }
            }
        }
    }

  # azurerm_storage_blob.site["assets/index-p0OaVyvT.js"] will be destroyed
  # (because azurerm_storage_blob.site is not in configuration)
  - resource "azurerm_storage_blob" "site" {
      - access_tier            = "Hot" -> null
      - content_md5            = "572ef299d62796eb7613cf34032bf3c3" -> null
      - content_type           = "application/javascript" -> null
      - id                     = "https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-p0OaVyvT.js" -> null
      - metadata               = {} -> null
      - name                   = "assets/index-p0OaVyvT.js" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "../../../../frontend/build/assets/index-p0OaVyvT.js" -> null
      - storage_account_name   = "opreopsdeveussfest" -> null
      - storage_container_name = "$web" -> null
      - type                   = "Block" -> null
      - url                    = "https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-p0OaVyvT.js" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + be_domain = "https://opre-ops-dev-eus-be-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
  - domain    = "https://opreopsdeveussfest.z13.web.core.windows.net" -> null
  + fe_domain = "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
```

Plan saved to GH artifacts.